## Администрирование компьютерной сети

Администрирование компьютерной сети включает в себя управление всеми компонентами сетевой инфраструктуры для обеспечения ее надежности, производительности и безопасности. В данной конфигурации используются маршрутизатор, коммутаторы, серверы и рабочие станции, что позволяет создать эффективную и безопасную сеть.

### Настройка коммутаторов

1. Первый коммутатор:
   - Создание VLAN 10, 30.
   ```
      Switch#configure terminal
      Switch(config)#vlan 10
      Switch(config-vlan)#name v10
      Switch(config-vlan)#exit
      Switch(config)#vlan 30
      Switch(config-vlan)#name v30
      Switch(config-vlan)#exit
   ```
   - Порты от 1 до 20: VLAN 30 для рабочих станций.
   ```
   Switch(config)#interface range GigabitEthernet  1/0/1-20
   Switch(config-if-range)#switchport mode access
   Switch(config-if-range)#switchport access vlan 30
   Switch(config-if-range)#exit
   ```
   - Порты 21 и 22: VLAN 10 для серверов БД.
   ```
   Switch(config)#interface range GigabitEthernet  1/0/21-22
   Switch(config-if-range)#switchport mode access
   Switch(config-if-range)#switchport access vlan 10
   Switch(config-if-range)#exit
   ```
   - Порт 24: Trunk 10, 30 для подключения к маршрутизатору.
   ```
   Switch(config)#interface GigabitEthernet 1/0/24
   Switch(config-if-range)#switchport mode trunk
   Switch(config-if-range)#switchport trunk allowed vlan 10,30
   Switch(config-if-range)#exit
   ```

2. Второй коммутатор:
   - Создание VLAN 20, 40.
   ```
      Switch#configure terminal
      Switch(config)#vlan 20
      Switch(config-vlan)#name v20
      Switch(config-vlan)#exit
      Switch(config)#vlan 40
      Switch(config-vlan)#name v40
      Switch(config-vlan)#exit
   ```
   - Порты от 1 до 20: VLAN 40 для рабочих станций.
   ```
   Switch(config)#interface range GigabitEthernet  1/0/1-20
   Switch(config-if-range)#switchport mode access
   Switch(config-if-range)#switchport access vlan 40
   Switch(config-if-range)#exit
   ```
   - Порты 21 и 22: VLAN 20 для веб-серверов.
   ```
   Switch(config)#interface range GigabitEthernet  1/0/21-22
   Switch(config-if-range)#switchport mode access
   Switch(config-if-range)#switchport access vlan 20
   Switch(config-if-range)#exit
   ```
   - Порт 24: Trunk 10, 40 для подключения к маршрутизатору.
   ```
   Switch(config)#interface GigabitEthernet 1/0/24
   Switch(config-if-range)#switchport mode trunk
   Switch(config-if-range)#switchport trunk allowed vlan 10,40
   Switch(config-if-range)#exit
   ```

### Настройка маршрутизатора

1. Создание подинтерфейсов для каждой VLAN:
   - Создание подинтерфейсов для каждой VLAN с IP-адресами:
     - ge1.10 192.168.1.1/29 encapsulation dot1q 10
     ```
     interface GigabitEthernet1.10
     encapsulation dot1q 10
     ip address 192.168.1.1 255.255.255.248
     description Database
     ```
     - ge2.20 192.168.1.9/29 encapsulation dot1q 20
     ```
     interface GigabitEthernet2.20
     encapsulation dot1q 20
     ip address 192.168.1.9 255.255.255.248
     description Web
     ```
     - ge1.30 192.168.1.33/27 encapsulation dot1q 30
     ```
     interface GigabitEthernet1.30
     encapsulation dot1q 30
     ip address 192.168.1.33 255.255.255.224
     description Work1
     ```
     - ge2.40 192.168.1.65/27 encapsulation dot1q 40
     ```
     interface GigabitEthernet1.30
     encapsulation dot1q 30
     ip address 192.168.1.65 255.255.255.224
     description Work2
     ```

### Безопасность (маршрутизация VLAN)

- Реализуются правила безопасности, чтобы обеспечить доступ только к необходимым ресурсам:
  - Веб-серверы (VLAN 20) могут обращаться к серверам баз данных (VLAN 10).
  - Рабочие станции (VLAN 40) могут получать доступ только к веб-серверам (VLAN 20).
  - Рабочие станции (VLAN 30) могут получать доступ только к серверам баз данных (VLAN 10).

